In [2]:
import pandas as pd
import numpy as np

In [7]:
df1=pd.DataFrame({"calisanlar":["meric","ali","melis","sezen"],
                 "grup":["muhendis","muhasebe","isci","söför"]})
df2=pd.DataFrame({"calisanlar":["meric","ali","melis","sezen"],
                 "yil":[2026,2100,2003,1421]})

In [8]:
pd.merge(df1,df2)

  calisanlar      grup   yil
0      meric  muhendis  2026
1        ali  muhasebe  2100
2      melis      isci  2003
3      sezen     söför  1421

In [9]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar      grup   yil
0      meric  muhendis  2026
1        ali  muhasebe  2100
2      melis      isci  2003
3      sezen     söför  1421